           SELECT ACD105 ASSIGN TO PATH-ACD105
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-ACD105
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-AC105 = NR-ATENDIMENTO-AC105
                                SEQ-REG-AC105.
