      *COMPLEMENTO DE ANOTAÇÕES DO CONTAS A RECEBER E CHEQUE-CONT CRD200
       FD  CRD201.
       01  REG-CRD201.
           05  COD-COMPL-CR201     PIC 9(9).
           05  SEQ-CR201           PIC 9(5).
           05  SUBSEQ-CR201        PIC 9(2).
           05  ANOTACAO-CR201      PIC X(80).
