      *  Movimento de atendimento a cliente - informacao
      *  a area competente
       FD  ACD104.
       01  REG-ACD104.
           05  NR-ATENDIMENTO-AC104     PIC 9(08).
           05  SEQ-REG-AC104            PIC 9(01).
           05  INFORMACAO-AC104         PIC X(80).
