           SELECT ACD102 ASSIGN TO PATH-ACD102
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-ACD102
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-AC102 = NR-ATENDIMENTO-AC102
                                SEQ-REG-AC102.
