           SELECT ACD104 ASSIGN TO PATH-ACD104
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-ACD104
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-AC104 = NR-ATENDIMENTO-AC104
                                SEQ-REG-AC104.
