      *  Cadastro de tipo de fornecedor
       FD  CAD019.
       01  REG-CAD019.
           05  CODIGO-TIPO         PIC 99.
           05  NOME-TIPO           PIC X(30).
