      *  Cadastro de Região
       FD  CAD012.
       01  REG-CAD012.
           05  CODIGO-REG               PIC 99.
           05  NOME-REG                 PIC X(10).
