       FD  CAD001A.
       01  REG-CAD001A.
           05  EMPRESA-CA001A        PIC 9(3).
           05  COD-USUARIO-CA001A    PIC 9(3).
           05  HD-CA001A             PIC 9(9).
           05  QTDE-LOGADO-CA001A    PIC 9(3).
           05  DATA-CA001A           PIC 9(8).
           05  FILLER                PIC X(92).
