           SELECT CAD002D ASSIGN TO "\PROGRAMA\KELLO\PADRAO\CAD002D"
                          ORGANIZATION IS INDEXED
                          ACCESS MODE IS DYNAMIC
                          LOCK MODE IS AUTOMATIC
                          WITH LOCK ON RECORD
                          STATUS IS ST-CAD002D
                          RECORD KEY IS CODIGO-CA002D.
