           SELECT CAD019 ASSIGN TO PATH-CAD019
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-TIPO
                  STATUS IS ST-CAD019
                  ALTERNATE RECORD KEY IS NOME-TIPO.
