           SELECT CBD002 ASSIGN TO PATH-CBD002
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CBD002
                  RECORD KEY IS CHAVE-CB02 =
                          CODIGO-FORN-CB02 FL-INICIAL-CB02.
