      *  arquivo que acumula saldo do c.corr-mes/ano de MOVTO e fornec
       FD  CCD011.
       01  REG-CCD011.
           05  ANOMES-MVTO-CC11           PIC 9(6).
           05  FORNEC-CC11                PIC 9(6).
           05  SALDOE-CC11                PIC 9(8)V99.
           05  SALDOS-CC11                PIC 9(8)V99.
