      * arquivo de valores de créditos liberados do conta corrente
       FD  CCD102.
       01  REG-CCD102.
           05  MESANO-BASE-CC102        PIC 9(6).
           05  CODIGO-CC102             PIC 9(6).
           05  VALOR-LIBERADO-CC102     PIC 9(8)V99.
