           SELECT CEAD010 ASSIGN TO "\PROGRAMA\KELLO\PADRAO\CEAD010"
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-CEAD010
                  RECORD KEY IS PRODUTO
                  ALTERNATE RECORD KEY IS ALT1 = GRUPO-PROD, PRODUTO.
