      * Cadastro de cartao de credito 
       FD  CGD020.
       01  REG-CGD020.
           05  CODIGO-CG20              PIC 99.
           05  NOME-CG20                PIC X(30).
           05  TAXA-CREDITO-CG20        PIC 9(03)V99.
           05  TAXA-PARCELA-CG20        PIC 9(03)V99.
           05  FILLER                   PIC X(10).
