           SELECT CGD020 ASSIGN TO PATH-CGD020
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-CGD020
                  RECORD KEY IS CODIGO-CG20
                  ALTERNATE RECORD KEY IS NOME-CG20.
