           SELECT CGD006 ASSIGN TO PATH-CGD006
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-CG06
                  STATUS IS ST-CGD006.
