      * Cadastro de mensagem Padrão p/CIE-Comunicação Interna Eletrônica
       FD  CIED001.
       01  REG-CIED001.
           05  CODIGO-CI01            PIC 99.
           05  MENSAGEM-CI01          PIC X(60).
           05  EXECUTADA-CI01         PIC X(20).
