      * Cadastro de Funções de recebedores de mensagens CIE
       FD  CIED002.
       01  REG-CIED002.
           05  CODIGO-CI02            PIC 99.
           05  DESCRICAO-CI02         PIC X(30).
           05  RESPONSAVEL-CI02       PIC 9(3).
           05  SUPERIOR-CI02          PIC 9(3).
      *    Responsavel-ci02/SUPERIOR-CI02 = cadastro do usuario(cad002)
