      * arquivo p/ consulta popup-up no extrato de contrato
       FD  COD040X.
       01  REG-COD040X.
           05  SEQ-CO40X           PIC 9(4).
           05  CIDADE-CO40X        PIC X(20).
           05  NR-CONTRATO-CO40X   PIC 9(4).
           05  IDENTIFICACAO-CO40X PIC X(10).
           05  INSTITUICAO-CO40X   PIC X(10).
           05  MESANO-CO40X        PIC 9(6).
