      *   arquivo de contatos do contrato - cont-cod500
       FD  COD501.
       01  REG-COD501.
           05  NR-CONTRATO-CO501  PIC 9(4).
           05  ITEM-CO501         PIC 9(3).
           05  SUBITEM-CO501      PIC 9(2).
           05  ANOTACAO-CO501     PIC X(80).
