           SELECT  COD005 ASSIGN TO PATH-COD005
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   LOCK MODE IS MANUAL WITH LOCK ON RECORD
                   STATUS IS ST-COD005
                   RECORD KEY IS PADRAO-CO05.
