           SELECT  COD009 ASSIGN TO PATH-COD009
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   LOCK MODE IS AUTOMATIC
                   WITH LOCK ON RECORD
                   STATUS IS ST-COD009
                   RECORD KEY IS CODIGO-CO09
                   ALTERNATE RECORD KEY IS NOME-CO09 WITH DUPLICATES.
