           SELECT CPAR001 ASSIGN       TO  PATH-CPAR001
                          ORGANIZATION IS       INDEXED
                          ACCESS MODE  IS       DYNAMIC
                          LOCK MODE    IS     AUTOMATIC
                          WITH LOCK    ON        RECORD
                          STATUS       IS    ST-CPAR001
                          RECORD KEY   IS CHAVE-CPAR001.
