      *  Arquivo de contas a pagar - contas desmembrada conta resultado
       FD  CPD023.
       01  REG-CPD023.
           05  FORNEC-CP23              PIC 9(6).
           05  SEQ-CP23                 PIC 9(5).
           05  ITEM-CP23                PIC 9(2).
           05  CODREDUZ-APUR-CP23       PIC 9(5).
           05  VALOR-CP23               PIC 9(8)V99.
