          SELECT CPD022 ASSIGN TO PATH-CPD022
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-CPD022
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-CP22 = FORNEC-CP22 SEQ-CP22.
