      *CADASTRO DE ANOTAÇÕES DO CONTAS A RECEBER E CHEQUES
       FD  CRD200.
       01  REG-CRD200.
           05  COD-COMPL-CR200     PIC 9(9).
           05  SEQ-CR200           PIC 9(5).
           05  DATA-MOVTO-CR200    PIC 9(8).
           05  HORA-MOVTO-CR200    PIC 9(4).
           05  DATA-RETORNO-CR200  PIC 9(8).
           05  USUARIO-CR200       PIC X(5).
           05  SITUACAO-ANOTACAO-CR200 PIC 9.
      *    SITUACAO-ANOTACAO-CR200 = 0-PENDENTE  1-CHECADO
