      * Cadastro de situação de título no Contas a Receber
       FD  CRD001.
       01  REG-CRD001.
           05  CODIGO-CR01           PIC 99.
           05  SITUACAO-TIT-CR01     PIC X(10).
           05  DESCRICAO-CR01        PIC X(30).
