      * Arquivo cadastro de tipo de lançamento no Caixa
       FD  CXD031.
       01  REG-CXD031.
           05  TIPO-LCTO-CX31      PIC 99.
           05  DESCRICAO-CX31      PIC X(30).
