      *  arquivo que acumula saldo do caixa por mes/ano e contapartida
       FD  CXD041.
       01  REG-CXD041.
           05  ANOMES-CX41                PIC 9(6).
           05  CONTAPART-CX41             PIC 9(5).
           05  SALDOE-CX41                PIC 9(8)V99.
           05  SALDOS-CX41                PIC 9(8)V99.
