      * Arquivo de movimento de caixa (imagens)
       FD  CXD100I.
       01  REG-CXD100I.
           05  SEQ-CX100I              PIC 9(04).
           05  DATA-MOV-CX100I         PIC 9(08).
           05  IMAGEM-CX100I           PIC X(255).
