      *   Liberacao dos Programas
       FD  GED002.
       01  REG-GED002.
           05  USUARIO-C-GE02      PIC 9(03).
           05  PROGRAMA-GE02       PIC X(38).
           05  USUARIO-P-GE02      PIC 9(03).
           05  IDENTIFICACAO-GE02  PIC X(60).
           05  OPERACAO-GE02       PIC X(10).
           05  DATA-LIMITE-GE02    PIC 9(08).
           05  FILLER              PIC X(50).

