      *  Cadastro de Cursos
       FD  IED011.
       01  REG-IED011.
           05  CODIGO-IE11              PIC 999.
           05  NOME-IE11                PIC X(40).
           05  NOME-REDUZ-IE11          PIC X(12).
