       FD  LBD107.
       01  REG-LBD107.
           05  DATA-REMESSA-L107         PIC 9(8).
           05  CONTRATO-L107             PIC 9(4).
           05  ITEM-L107                 PIC 9(2).
           05  QTDE-IDENT-L107           PIC 9(4).
           05  OBSERVACAO-L107           PIC X(40).
