      *cadastro de impressora
       FD  LBD026.
       01  REG-LBD026.
           05  CODIGO-LB26                PIC 9(02).
           05  DESCRICAO-LB26             PIC X(20).
