      * CADASTRO DE TIPO DE FOTOS - LABORATORIO
       FD  LBD027.
       01  REG-LBD027.
           05  CODIGO-LB27              PIC 9(02).
           05  DESCRICAO-LB27           PIC X(20).
