           SELECT LBD021 ASSIGN TO PATH-LBD021
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD021
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-LB21
                  ALTERNATE RECORD KEY IS DESCRICAO-LB21
                                    WITH DUPLICATES.
