           SELECT LBD025 ASSIGN TO PATH-LBD025
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-LBD025
                  RECORD KEY IS CODIGO-LB25
                  ALTERNATE RECORD KEY IS DESCRICAO-LB25
                            WITH DUPLICATES.
