           SELECT LBD028 ASSIGN TO PATH-LBD028
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD028
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-LB28
                  ALTERNATE RECORD KEY IS DESCRICAO-LB28
                               WITH DUPLICATES.
