           SELECT LBD020 ASSIGN TO DISK
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD020
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-20
                  ALTERNATE RECORD KEY IS NOME-20 WITH DUPLICATES.
