      *CADASTRO DE CONTRATO P/ MONTAGEM
       FD  MTD001P.
       01  REG-MTD001P.
           05  CONTRATO-MT01P       PIC 9(4).
           05  PRODUTO-MT01P        PIC 9(4).
           05  MODELO-MT01P         PIC 9(4).
           05  CUSTO-MT01P          PIC 9(6)V999.
           05  FILLER               PIC X(100).
