      *  Cadastro de Status de Contrato (que aparece no MTD060)
       FD  MTD060.
       01  REG-MTD060.
           05  CODIGO-MTD060            PIC 99.
