      *ARQUIVO DE PRIORIODADE DA CAMPANHA P/ PRODUÇÃO
       FD  MTD024.
       01  REG-MTD024.
           05  CAMPANHA-MT24      PIC 9(2).
           05  PRIORIDADE-MT24    PIC 9(4).
