      * CADASTRO DE LOCAL DE ARMAZENAMENTO DO ALBUM EM ESTOQUE
       FD  MTD002.
       01  REG-MTD002.
           05  CODIGO-MT02            PIC 9(2).
           05  NOME-MT02              PIC X(10).
