      *  Cadastro de Status de Contrato (que aparece no MTD051)
       FD  MTD051.
       01  REG-MTD051.
           05  CODIGO-MTD051            PIC 99.
