           SELECT  MTD024 ASSIGN TO PATH-MTD024
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   LOCK MODE IS MANUAL WITH LOCK ON RECORD
                   STATUS IS ST-MTD024
                   RECORD KEY IS CHAVE-MT24 = CAMPANHA-MT24.
