       01  PARAMETROS-W.
           10  USUARIO-W         PIC X(5).
           10  EMPRESA-W         PIC 9(3).
           10  IMPRESSORA-W      PIC 99.
           10  COD-USUARIO-W     PIC 9(3).
           10  SENHA-W           PIC 9(4).
           10  NOME-EMPRESA-W    PIC X(60).
