           SELECT PAR002 ASSIGN       TO  PATH-PAR002
                         ORGANIZATION IS      INDEXED
                         ACCESS MODE  IS      DYNAMIC
                         LOCK MODE    IS    AUTOMATIC
                         WITH LOCK    ON       RECORD
                         STATUS       IS    ST-PAR002
                         RECORD KEY   IS CHAVE-PAR002.
