      *OBSERVACOES SOBRE CONVITE
       FD  PRD012.
       01  REG-PRD012.
           05  CONTRATO-PR12            PIC 9(04).
           05  SEQUENCIA-PR12           PIC 9(02).
           05  OBSERVACAO-PR12          PIC X(80).
