           SELECT PRD011 ASSIGN TO PATH-PRD011
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-PRD011
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-PR11 = DOCTO-PR11 CODIGO-PR11
                  ALTERNATE RECORD KEY IS ALT-PR11 = CODIGO-PR11
                     VEZ-APRESENTA-PR11 WITH DUPLICATES.
