      *VALOR DA PERCENTAGEM DA COMISSÃO DO VENDEDOR
       FD  RCD110.
       01  REG-RCD110.
           05 CHAVE-RC110.
              10 CODIGO-RC110                     PIC 9(06).
           05 DESCRICAO-RC110                     PIC X(50).
           05 LIMITE-PARCELA-RC110                PIC 9(03).
           05 SEM-ENTRADA-RC110                   PIC 9(01).
           05 CALCULA-JUROS-RC110                 PIC 9(01).
           05 FILLER                              PIC X(50).

