      *ARQUIVO DE FAIXA DE VALORES (PRINCIPAL RCD112 ITENS)
       FD  RCD111.
       01  REG-RCD111.
           05 CHAVE-RC111.
              10 CODIGO-RC111                     PIC 9(06).
           05 DESCRICAO-RC111                     PIC X(50).
           05 FILLER                              PIC X(50).

