           SELECT RCD002 ASSIGN TO PATH-RCD002
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-RCD002
                  RECORD KEY IS CHAVE-RC02.
