           SELECT RCD110 ASSIGN TO PATH-RCD110
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-RCD110
                  RECORD KEY IS CHAVE-RC110.
