           SELECT RCD111 ASSIGN TO PATH-RCD111
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-RCD111
                  RECORD KEY IS CHAVE-RC111.
