           SELECT RCD1101 ASSIGN TO PATH-RCD1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-RCD1101
                  RECORD KEY IS CHAVE-RC1101.
