           SELECT RCD109 ASSIGN TO PATH-RCD109
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-RCD109
                  RECORD KEY IS CHAVE-RC109.
