       FD  RED302
           LABEL RECORD IS STANDARD
           RECORD CONTAINS 9 CHARACTERS
           VALUE OF FILE-ID IS RE302.
       01  REG-RED302.
           05  DOCTO-R302           PIC 9(6).
           05  EVENTO-R302          PIC 999.
