      *CADASTRO DE SITUAÇÃO DE VEICULOS
       FD  RED004.
       01  REG-RED004.
           05  CODIGO-RE04         PIC 9(2).
           05  DESCRICAO-RE04      PIC X(20).
