      *CADASTRO DE EQUIPAMENTOS - REPORTAGEM
       FD  RED001.
       01  REG-RED001.
           05  CODIGO-RE01         PIC 9(3).
           05  DESCRICAO-RE01      PIC X(20).
