      *  Cadastro de Status de Contrato (que aparece no REP205)
       FD  RED205.
       01  REG-RED205.
           05  CODIGO-RED205            PIC 99.
