      *CADASTRO DE MATERIAIS P/ PLANEJAMENTO
       FD  RED003.
       01  REG-RED003.
           05  CODIGO-RE03         PIC 9(3).
           05  DESCRICAO-RE03      PIC X(25).
