      * CADASTRO DE CATEGORIA DE KILOMETRAGEM DE VEICULOS
      * VALOR POR KILOMETRO
       FD  RED007.
       01  REG-RED007.
           05  CODIGO-RE07           PIC 9(2).
           05  CATEGORIA-RE07        PIC X(15).
           05  VALOR-RE07            PIC 9(8)V99.
