      *CADASTRO DE FUNÇÕES - REPORTAGEM
       FD  RED002.
       01  REG-RED002.
           05  CODIGO-RE02         PIC 9(2).
           05  DESCRICAO-RE02      PIC X(20).
           05  ACUMULAR-RE02       PIC 9(2).
