           SELECT RED020 ASSIGN TO PATH-RED020
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-R020
                  ALTERNATE RECORD KEY IS NOME-R020 WITH DUPLICATES
                  STATUS ST-RED020.
