           SELECT RED001 ASSIGN TO PATH-RED001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED001
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-RE01
                  ALTERNATE RECORD KEY IS DESCRICAO-RE01.
