           SELECT RED502 ASSIGN TO PATH-RED502
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED502
                  RECORD KEY IS CHAVE-RE502 = DATA-RE502 CIDADE-RE502
                  ALTERNATE RECORD KEY IS ALT1-RE502 =
                      DATA-RE502 NOME-CIDADE-RE502 WITH DUPLICATES.
