      *  ARQUIVO DE INSTRUÇÕES E OBS DE INSERT DE VÍDEO
       FD  VID114.
       01  REG-VID114.
           05  CONTRATO-V114          PIC 9(4).
           05  ITEM-V114              PIC 9(2).
           05  SEQ-V114               PIC 9(2).
           05  FUNCIONARIO-V114       PIC 9(6).
           05  REVISOR-V114           PIC 9(6).
           05  DATA-V114              PIC 9(8).
           05  HORARIO-V114           PIC 9(4).
           05  USUARIO-V114           PIC X(5).
