      *  CADASTRO DE PROBLEMAS C/ CINEGRAFISTA
       FD  VID021.
       01  REG-VID021.
           05  CODIGO-V21                PIC 9(03).
           05  DESCRICAO-V21             PIC X(30).
