      *   ARQUIVO DE INTERRRUPCAO P/ EDIÇÃO/COPIA/INSERT
       FD  VID109.
       01  REG-VID109.
           05  CONTRATO-V109          PIC 9(4).
           05  ITEM-V109              PIC 9(2).
           05  TIPO-ATIV-V109         PIC 9.
      *    1-EDIÇÃO  2-COPIA  3-INSERT
           05  TIPO-INTERRUP-V109     PIC 9(2).
           05  TEMPO-INTERRUP-V109    PIC 9(4).
           05  FUNCIONARIO-V109       PIC 9(6).
