           SELECT VID119 ASSIGN TO PATH-VID119
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-V119 = CONTRATO-V119 ITEM-V119
                                             TIPO-V119 SEQ-V119
                  STATUS IS ST-VID119.
