           SELECT VID022 ASSIGN TO PATH-VID022
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-VID022
                  RECORD KEY IS CODIGO-V22
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  ALTERNATE RECORD KEY IS DESCRICAO-V22 WITH DUPLICATES.
