           SELECT VID111 ASSIGN TO PATH-VID111
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-V111 = CONTRATO-V111 ITEM-V111
                                             TIPO-V111 SEQ-V111
                  STATUS IS ST-VID111.
