           SELECT CCD105 ASSIGN TO PATH-CCD105
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CCD105
                  RECORD KEY IS CHAVE-CC105 = MESANO-BASE-CC105
                                        CODIGO-CC105.
