           SELECT CCD120 ASSIGN TO PATH-CCD120
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-CCD120
                  RECORD KEY IS CHAVE-CC120 = MESANO-BASE-CC120
                         CODIGO-CC120.
