      *   Cadastro de motivos 
       FD  COD008.
       01  REG-COD008.
           05  CODIGO-CO08         PIC 9(03).
           05  DESCRICAO-CO08      PIC X(30).
           05  FILLER              PIC X(15).

