      *CADASTRO DE CONTRATO (COMPLEMENTO)
       FD  COD049.
       01  REG-COD049.
           05  NR-CONTRATO-CO49         PIC 9(4).
           05  CANCELADO-CO49           PIC 9(1).
           05  USUARIO-CADASTRO-CO49    PIC X(05).
           05  DATA-CADASTRO-CO49       PIC 9(08).
           05  HORA-CADASTRO-CO49       PIC 9(04).
           05  PREPOSTO-CO49            PIC 9(06).
           05  FILLER                   PIC X(17).
