      *CADASTRO DE EQUIPAMENTO POR PESSOA
       FD  RED008.
       01  REG-RED008.
           05  PROPRIETARIO-RE08        PIC 9(6).
           05  EQUIPAMENTO-RE08         PIC 9(3).
