      *  Cadastro de Status de Contrato (que aparece no REP204)
       FD  RED204.
       01  REG-RED204.
           05  CODIGO-RED204            PIC 99.
