           SELECT RED004 ASSIGN TO PATH-RED004
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED004
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-RE04
                  ALTERNATE RECORD KEY IS DESCRICAO-RE04.
