           SELECT RED300 ASSIGN TO PATH-RED300
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED300
                  RECORD KEY IS DOCTO-R300
                  ALTERNATE RECORD KEY IS DATA-MOV-R300 WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ANOMES-R300 WITH DUPLICATES.
