           SELECT RED003 ASSIGN TO PATH-RED003
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED003
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-RE03
                  ALTERNATE RECORD KEY IS DESCRICAO-RE03.
