           SELECT RED009 ASSIGN TO PATH-RED009
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED009
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-RE09 = FORM-MIN-RE09 PADRAO-RE09
                  ALTERNATE RECORD KEY IS PADRAO-RE09 WITH DUPLICATES.
