           SELECT RED006 ASSIGN TO PATH-RED006
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-RED006
                  RECORD KEY IS CODIGO-RE06
                  ALTERNATE RECORD KEY IS VEICULO-RE06 WITH DUPLICATES.
