           SELECT RED030 ASSIGN TO PATH-RED030
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-R030
                  ALTERNATE RECORD KEY IS NOME-R030 WITH DUPLICATES
                  STATUS ST-RED030.
