      *ARQUIVO DE OBSERVACAO DA AVALIACAO DO CINEGRAFISTA
       FD  VID103.
       01  REG-VID103.
           05  NR-FITAS-V103.
               10 CONTRATO-V103          PIC 9(04).
               10 NR-FITA-V103           PIC 9(5).
           05  SEQ-V103                  PIC 9(2).
           05  OBS-V103                  PIC X(100).
