      *CADASTRO DE FILMADORA - VIDEO-LABORATORIO
       FD  VID020.
       01  REG-VID020.
           05  CODIGO-V20                PIC 9(02).
           05  DESCRICAO-V20             PIC X(12).
