      *  ARQUIVO DE INSTRUÇÕES E OBS DE COPIA DE VÍDEO - LINHAS DE OBS
       FD  VID113.
       01  REG-VID113.
           05  CONTRATO-V113          PIC 9(4).
           05  ITEM-V113              PIC 9(2).
           05  SEQ-V113               PIC 9(2).
           05  SUBSEQ-V113            PIC 9(2).
           05  OBS-V113               PIC X(100).
