      *  PROTOCOLO DAS REMESSAS DE FITAS BRUTAS DO SET.QUALID P/ PRODUC
       FD  VID130.
       01  REG-VID130.
           05  DATA-V130           PIC 9(8).
           05  LOTE-V130           PIC 9(2).
           05  NR-FITAS-V130.
               10 CONTRATO-V130    PIC 9(4).
               10 NR-FITA-V130     PIC 9(5).
