      * arquivo de fitas master
       FD  VID106.
       01  REG-VID106.
           05  CONTRATO-V106          PIC 9(4).
           05  ITEM-V106              PIC 9(2).
           05  NR-MASTER-V106         PIC 99.
           05  NR-FITA-V106           PIC 9(5).
           05  PERSONALIZAR-V106      PIC 9.
      *    personalizar = 1-sim  2-não
           05  TEMPO-V106             PIC 9(4).
      *    HORA/MIN
