      * ARQUIVO DE OBS - ARQUIVO DE VÍDEO - PARTE CABECALHO
      * SE TIPO = 1-DPTO VENDAS  2-QUALIDADE GERAL
       FD  VID118.
       01  REG-VID118.
           05  CONTRATO-V118           PIC 9(4).
           05  ITEM-V118               PIC 9(2).
           05  TIPO-V118               PIC 9.
           05  DATA-V118               PIC 9(8).
           05  HORARIO-V118            PIC 9(4).
           05  USUARIO-V118            PIC X(5).
