      *CADASTRO DE MOMENTOS EM FILMAGEM
       FD  VID022.
       01  REG-VID022.
           05  CODIGO-V22               PIC 9(03).
           05  DESCRICAO-V22            PIC X(20).
