      * ARQUIVO DE OBS E INSTRUÇÕES DE VÍDEO
      * SE TIPO = 1-EDIÇÃO   2-CÓPIA   3-INSERT
       FD  VID111.
       01  REG-VID111.
           05  CONTRATO-V111           PIC 9(4).
           05  ITEM-V111               PIC 9(2).
           05  TIPO-V111               PIC 9.
           05  SEQ-V111                PIC 9(2).
           05  OBS-V111                PIC X(100).
