           SELECT VID108 ASSIGN TO PATH-VID108
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-V108 = CONTRATO-V108 ITEM-V108
                  STATUS IS ST-VID108.
