           SELECT VID102 ASSIGN TO PATH-VID102
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-VID102
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-V102 = NR-FITAS-V102 SEQ-V102.
