           SELECT VID109 ASSIGN TO PATH-VID109
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-V109 = CONTRATO-V109 ITEM-V109
                     TIPO-ATIV-V109 TIPO-INTERRUP-V109
                  STATUS IS ST-VID109.
