           SELECT VID118 ASSIGN TO PATH-VID118
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-V118 = CONTRATO-V118 ITEM-V118
                                               TIPO-V118
                  STATUS IS ST-VID118.
