           SELECT VID103 ASSIGN TO PATH-VID103
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-VID103
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-V103 = NR-FITAS-V103 SEQ-V103.
