           SELECT VID105 ASSIGN TO PATH-VID105
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-V105 = CONTRATO-V105 ITEM-V105
                  STATUS IS ST-VID105.
