           SELECT VID021 ASSIGN TO PATH-VID021
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-VID021
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-V21
                  ALTERNATE RECORD KEY IS DESCRICAO-V21 WITH DUPLICATES.
