           SELECT VID107 ASSIGN TO PATH-VID107
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-V107 = CONTRATO-V107 ITEM-V107
                  STATUS IS ST-VID107.
