      *   Cadastro de Definição de Tipos
       FD  ACD020.
       01  REG-ACD020.
           05  TIPO-AC20           PIC 9(01).
           05  CODIGO-AC20         PIC 9(03).
           05  DESCRICAO-AC20      PIC X(60).
           05  FILLER              PIC X(50).

      *    TIPO-AC20 = 1 VENDIDO , 2 Ñ VENDIDO
