      *  Movimento de atendimento a cliente - PROCEDIMENTOS
      *  AREA   
       FD  ACD103.
       01  REG-ACD103.
           05  NR-ATENDIMENTO-AC103     PIC 9(08).
           05  SEQ-REG-AC103            PIC 9(01).
           05  PROCEDIMENTO-AC103       PIC 9(06).
