      *   Cadastro de Procedimentos
       FD  ACD030.
       01  REG-ACD030.
           05  CODIGO-AC30         PIC 9(06).
           05  DESCRICAO-AC30      PIC X(60).
           05  FILLER              PIC X(100).
