      *  Movimento de atendimento a cliente - retorno   
      *  ao cliente       
       FD  ACD106.
       01  REG-ACD106.
           05  NR-ATENDIMENTO-AC106     PIC 9(08).
           05  SEQ-REG-AC106            PIC 9(01).
           05  RETORNO-AC106            PIC X(80).
