           SELECT ACD101 ASSIGN TO PATH-ACD101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-ACD101
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-AC101 = NR-ATENDIMENTO-AC101
                                SEQ-REG-AC101.
