           SELECT ACD106 ASSIGN TO PATH-ACD106
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-ACD106
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-AC106 = NR-ATENDIMENTO-AC106
                                SEQ-REG-AC106.
