      *  Cadastro de contas bancárias p/posição financeira, que
      *  deverá ser o mesmo código do cadastro geral - Codigo-CG01
       FD  CAD013.
       01  REG-CAD013.
           05  CODIGO-CA13         PIC 9(6).
