      *   Cadastro de programas liberados p/ acesso conforme senha
       FD  CAD004.
       01  REG-CAD004.
           05  COD-USUARIO-CA004   PIC 9(3).
           05  PROGRAMA-CA004      PIC X(8).
