      *cadastro de departamento
       FD  CAD014.
       01  REG-CAD014.
           05  CODIGO-CA14              PIC 99.
           05  DEPARTAMENTO-CA14        PIC X(10).
