      * Cadastro de USUARIO
       FD  CAD002.
       01  REG-CAD002.
           05  CODIGO-CA002        PIC 9(03).
           05  SENHA-CA002         PIC 9(04) COMP-3.
           05  NOME-CA002          PIC X(30).
           05  NOME-REDUZ-CA002    PIC X(05).
           05  IMPRESSORA-CA002    PIC 9(02).
