      * Cadastro de USUARIO
       FD  CAD002E.
       01  REG-CAD002E.
           05  EMPRESA-CA002E       PIC 9(03).
           05  COD-USUARIO-CA002E   PIC 9(03).
