      *  Cadastro de Portador
       FD  CAD018.
       01  REG-CAD018.
           05  PORTADOR            PIC 9999.
           05  NOME-PORT           PIC X(20).
