      *   Cadastro de Eventos
       FD  CAD003.
       01  REG-CAD003.
           05  PROGRAMA-CA003      PIC X(8).
           05  DESCRICAO-CA003     PIC X(30).
