           SELECT CAD018 ASSIGN TO PATH-CAD018
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-CAD018
                  RECORD KEY IS PORTADOR
                  ALTERNATE RECORD KEY IS NOME-PORT.
