           SELECT CAD001D ASSIGN "\PROGRAMA\KELLO\PADRAO\CAD001D"
                          ORGANIZATION IS                 INDEXED
                          ACCESS MODE  IS                 DYNAMIC
                          LOCK MODE    IS               AUTOMATIC
                          WITH LOCK    ON                  RECORD
                          STATUS       IS              ST-CAD001D
                          RECORD KEY   IS           CODIGO-CA001D.
