           SELECT  CAD090 ASSIGN TO PATH-CAD090
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   LOCK MODE IS MANUAL WITH LOCK ON RECORD
                   STATUS IS ST-CAD090
                   RECORD KEY IS CODIGO-090
                   ALTERNATE RECORD KEY IS NOME-090 WITH DUPLICATES.
