           SELECT CAD004 ASSIGN TO PATH-CAD004
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-CAD004
                  RECORD KEY IS CHAVE-CA004 = COD-USUARIO-CA004
                      PROGRAMA-CA004.
