           SELECT CAD014 ASSIGN TO PATH-CAD014
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-CAD014
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-CA14
                  ALTERNATE RECORD KEY IS DEPARTAMENTO-CA14.
