      * Cadastro de contas bancárias - contrapartida banco
      * para lançamentos automáticos pela conciliação bancária.
       FD  CBD005.
       01  REG-CBD005.
           05  TIPO-HIST-CB05        PIC 99.
           05  BANCO-CB05            PIC 9(6).
           05  CONTRAPART-BANCO-CB05 PIC 9(6).
