      * Cadastro de lançamentos em extrato bancário
       FD  CBD004.
       01  REG-CBD004.
           05  CODIGO-CB04         PIC 99.
           05  HISTORICO-CB04      PIC X(30).
           05  APURACAO-RED-C-CB04 PIC 9(5).
           05  APURACAO-RED-D-CB04 PIC 9(5).
