      * saldo diario dos extratos bancários
       FD  CBD102.
       01  REG-CBD102.
           05  DATA-EXTRATO-CB102  PIC 9(8).
           05  CONTA-BANCO-CB102   PIC 9(6).
           05  SALDO-CB102         PIC S9(8)V99.
