           SELECT CBD004 ASSIGN TO PATH-CBD004
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CBD004
                  RECORD KEY IS CODIGO-CB04
                  ALTERNATE RECORD KEY IS HISTORICO-CB04.
