           SELECT CBD001 ASSIGN TO PATH-CBD001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-CBD001
                  RECORD KEY IS CODIGO-FORN-CB01
                  ALTERNATE RECORD KEY IS TITULAR-CB01 WITH DUPLICATES
                  ALTERNATE RECORD KEY IS NOME-BANCO-CB01
                            WITH DUPLICATES.
