           SELECT CBD005 ASSIGN TO PATH-CBD005
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CBD005
                  RECORD KEY IS CHAVE-CB05 = TIPO-HIST-CB05 BANCO-CB05.
