      *  arquivo que acumula saldo do c.corr-mes/ano de vencto e fornec
       FD  CCD010.
       01  REG-CCD010.
           05  ANOMES-VCTO-CC10           PIC 9(6).
           05  FORNEC-CC10                PIC 9(6).
           05  SALDOE-CC10                PIC 9(8)V99.
           05  SALDOS-CC10                PIC 9(8)V99.
