           SELECT CCD102 ASSIGN TO PATH-CCD102
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CCD102
                  RECORD KEY IS CHAVE-CC102 = MESANO-BASE-CC102
                                              CODIGO-CC102.
