           SELECT CCD101 ASSIGN TO PATH-CCD101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-CCD101
                  RECORD KEY IS FORNEC-CC101.
