           SELECT CCD115 ASSIGN TO PATH-CCD115
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CCD115
                  RECORD KEY IS CHAVE-CC115 = MESANO-BASE-CC115
                                        CODIGO-CC115.
