      * Cadastro de remetente 
       FD  CGD030.
       01  REG-CGD030.
           05  CODIGO-CG30           PIC 99.
           05  NOME-CG30             PIC X(40).
           05  ENDERECO-CG30         PIC X(40).
           05  CIDADE-CG30           PIC 9(04).
           05  CEP-CG30              PIC 9(08).
           05  FILLER                PIC X(20).
