           SELECT CGD001 ASSIGN TO PATH-CGD001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-CG01
                  STATUS IS ST-CGD001
                  ALTERNATE RECORD KEY IS NOME-CG01.
