           SELECT CGD005 ASSIGN TO PATH-CGD005
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-CG05
                  ALTERNATE RECORD KEY IS CODIGO-REPORT-CG05
                            WITH DUPLICATES
                  STATUS IS ST-CGD005.
