      * controle de sequencia do movto de cheques - pela data de movto
       FD  CHD011.
       01  REG-CHD011.
           05  DATA-MOVTO-CH11      PIC 9(8).
           05  SEQ-CH11             PIC 9(4).
