      * cadastro de origem de cheques
       FD  CHD012.
       01  REG-CHD012.
           05  CODIGO-CH12        PIC 9(2).
           05  DESCR-ORIGEM-CH12  PIC X(10).
