           SELECT CIED001 ASSIGN TO "\PROGRAMA\KELLO\PADRAO\CIED001"
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CIED001
                  RECORD KEY IS CODIGO-CI01.
