      *  Cadastro de Status de Contrato (que aparece no COP111)
       FD  COD111.
       01  REG-COD111.
           05  CODIGO-COP111            PIC 99.
