       FD  COD007.
       01  REG-COD007.
           05 alt1-CO007.
              10 num-cid-CO007    pic 9999.
              10 mesano-CO007     pic 9(6).
              10 nome-curso-CO007 pic x(10).
              10 contrato-CO007   pic 9999.
           05 nome-cid-CO007      pic x(20).
           05 abc-CO007           pic 9(8)v99.
           05 representante-CO007 pic X(9).
           05 part1-CO007         pic x(130).
           05 part2-CO007         pic x(130).
