      *  Cadastro de Status de Contrato (que aparece no COP106)
       FD  COD106.
       01  REG-COD106.
           05  CODIGO-COP106            PIC 99.
