      *CADASTRO DE PADRAO
       FD  COD005.
       01  REG-COD005.
           05  PADRAO-CO05         PIC X.
           05  PREV-FOTOS-CO05     PIC 9(3).
