      * CADASTRO DE CAMPANHAS DE CONTRATO
       FD  COD004.
       01  REG-COD004.
           05  CODIGO-CO04       PIC 99.
           05  DATA-INI-CO04     PIC 9(8).
           05  DATA-FIM-CO04     PIC 9(8).
