      *  CADASTRO DE EVENTOS - COMPLEMENTO
       FD  COD060C.
       01  REG-COD060C.
           05  NR-CONTRATO-CO60C PIC 9(04).
           05  ITEM-CO60C        PIC 999.
           05  USUARIO-CAD-CO60C PIC X(05).
           05  DATA-CAD-CO60C    PIC 9(08).
           05  FILLER            PIC X(40).
