      *  Cadastro de Status de Contrato (que aparece no COP104)
       FD  COD104.
       01  REG-COD104.
           05  CODIGO-COP104            PIC 99.
