      * cadastro de contrato/produto
       FD  COD045.
       01  REG-COD045.
           05  NR-CONTRATO-CO45   PIC 9(4).
           05  PRODUTO-CO45       PIC 9(4).
           05  MODELO-CO45        PIC 9(4).
           05  QTDE-PRODUTO-CO45  PIC 9(5).
           05  CUSTO-CO45         PIC 9(4)V999.
           05  VENDA-CO45         PIC 9(6)V999.
           05  FILLER             PIC X(100).
