      *  Cadastro de Status de Contrato (que aparece no COP104)
       FD  COD101.
       01  REG-COD101.
           05  CODIGO-COP101            PIC 99.
