           SELECT  COD002 ASSIGN TO PATH-COD002
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   LOCK MODE IS AUTOMATIC
                   WITH LOCK ON RECORD
                   STATUS IS ST-COD002
                   RECORD KEY IS CODIGO-CO02
                   ALTERNATE RECORD KEY IS NOME-CO02 WITH DUPLICATES.
