           SELECT COD049 ASSIGN TO PATH-COD049
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-COD049
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS NR-CONTRATO-CO49.
