           SELECT  COD081 ASSIGN TO PATH-COD081
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   STATUS IS ST-COD081
                   LOCK MODE IS MANUAL WITH LOCK ON RECORD
                   RECORD KEY IS NR-CONTRATO-CO81.
