           SELECT COD042 ASSIGN TO PATH-COD042
                  ORGANIZATION INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS SEQ-CO42
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  ALTERNATE RECORD KEY IS IDENTIFICACAO-CO42
                             WITH DUPLICATES
                  STATUS IS ST-COD042.
