
       01  PARAMETROS-GRADAY.
           05 GRADAY-DATA                    PIC 9(008) VALUE ZERO.
           05 GRADAY-DIAS                    PIC 9(004) VALUE ZERO.

