
       01  PARAMETROS-GRDCIC.
           05 GRDCIC-CIC                     PIC 9(011) VALUE ZERO.
           05 GRDCIC-RETORNO                 PIC X(002) VALUE SPACES.

