
       01  PARAMETROS-GREXTE.
           05 GREXTE-VALOR-BASE              PIC 9(012)V99 VALUE ZERO.
           05 GREXTE-VALOR-EXTENSO           PIC X(231)    VALUE SPACES.

