      *  Arquivo que armazena observações referente a lançamentos no
      *  contas a pagar
       FD  CPD022.
       01  REG-CPD022.
           05  FORNEC-CP22              PIC 9(6).
           05  SEQ-CP22                 PIC 9(5).
           05  OBS-CP22                 PIC X(120).
