          SELECT CPD024 ASSIGN TO PATH-CPD024
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-CPD024
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-CP24 = FORNEC-CP24 SEQ-CP24.
