
       01  PARAMETROS-GRWEEK.
           05 GRWEEK-DATA                    PIC  9(008) VALUE ZERO.
           05 GRWEEK-DIA                     PIC  9(001) VALUE ZERO.
           05 GRWEEK-EXTENSO                 PIC  X(007) VALUE SPACES.

