      * arquivo de sequencia do contas a receber
       FD  CRD021.
       01  REG-CRD021.
           05  COD-COMPL-CR21.
               10  CLASS-CLIENTE-CR21   PIC 9.
               10  CLIENTE-CR21         PIC 9(8).
           05  SEQ-CR21                 PIC 9(5).
