          SELECT CRD022 ASSIGN TO PATH-CRD022
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-CRD022
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-CR22 = COD-COMPL-CR22 SEQ-CR22.
