      * Arquivo cadastro padrão de historicos p/ o movto caixa
       FD  CXD030.
       01  REG-CXD030.
           05  COD-HISTORICO-CX30  PIC 99.
           05  HISTORICO-CX30      PIC X(30).
