      * Arquivo que acumula saldo do caixa mensal
       FD  CXD040.
       01  REG-CXD040.
           05  ANOMES-CX40                PIC 9(06).
           05  SALDOE-CX40                PIC 9(08)V99.
           05  SALDOS-CX40                PIC 9(08)V99.
