      *  Arquivo que acumula saldo do caixa por mes/ano e conta apuração
       FD  CXD042.
       01  REG-CXD042.
           05  ANOMES-CX42                PIC 9(06).
           05  CONTAREDUZ-CX42            PIC 9(05).
           05  SALDOE-CX42                PIC 9(08)V99.
           05  SALDOS-CX42                PIC 9(08)V99.
