      *   Cadastro de programas liberados p/ acesso conforme senha
       FD  CXD004.
       01  REG-CXD004.
           05  COD-USUARIO-CX004   PIC 9(3).
           05  PROGRAMA-CX004      PIC 9(5).
