           SELECT CXD0020 ASSIGN TO DISK
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CXD0020
                  RECORD KEY IS CODIGO-REDUZ-CX20
                  ALTERNATE RECORD KEY IS CODIGO-CX20
                  ALTERNATE RECORD KEY IS DESC-CX20 WITH DUPLICATES.
