      *   Cadastro de Usuario CHEFES
       FD  GED001.
       01  REG-GED001.
           05  USUARIO-GE01        PIC 9(03).
           05  PROGRAMA-GE01       PIC X(38).
           05  DESCRICAO-GE01      PIC X(60).
           05  FILLER              PIC X(50).

