           SELECT IED011 ASSIGN TO PATH-IED011
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-IED011
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-IE11
                  ALTERNATE RECORD KEY IS NOME-IE11.
