           SELECT IED010 ASSIGN TO PATH-IED010
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              LOCK MODE IS AUTOMATIC
              WITH LOCK ON RECORD
              STATUS IS ST-IED010
              RECORD KEY IS CODIGO-IE10
              ALTERNATE RECORD KEY IS NOME-IE10 WITH DUPLICATES
              ALTERNATE RECORD KEY IS ALT-IE10 = CIDADE-IE10 NOME-IE10
                        WITH DUPLICATES.
