       FD  LBD022
           LABEL RECORD IS STANDARD
           RECORD CONTAINS 33 CHARACTERS
           VALUE OF FILE-ID IS LB022.
       01  REG-LBD022.
           05  CODIGO-22                PIC 9(03).
           05  NOME-22                  PIC X(30).
