      *CADASTRO DE PROBLEMAS EM FOTOGRAFIA
       FD  LBD025.
       01  REG-LBD025.
           05  CODIGO-LB25              PIC 9(03).
           05  DESCRICAO-LB25           PIC X(30).
