      * CADASTRO DE INTERRUPÇÃO
       FD  LBD029.
       01  REG-LBD029.
           05  CODIGO-LB29                PIC 9(02).
           05  DESCRICAO-LB29             PIC X(20).
