      *CADASTRO DE MOMENTOS EM EVENTO - LABORATÓRIO
       FD  LBD024.
       01  REG-LBD024.
           05  CODIGO-LB24              PIC 9(03).
           05  DESCRICAO-LB24           PIC X(20).
