       FD  LBD020
           LABEL RECORD IS STANDARD
           RECORD CONTAINS 33 CHARACTERS
           VALUE OF FILE-ID IS LB020.
       01  REG-LBD020.
           05  CODIGO-20                PIC 9(03).
           05  NOME-20                  PIC X(30).
