      *CADASTRO DE OPERAÇÕES
       FD  LBD028.
       01  REG-LBD028.
           05  CODIGO-LB28              PIC 9(03).
           05  DESCRICAO-LB28           PIC X(30).
