      *CADASTRO DE PROBLEMAS DE FOTOS NA MONTAGEM
       FD  LBD030.
       01  REG-LBD030.
           05  CODIGO-LB30               PIC 9(03).
           05  DESCRICAO-LB30            PIC X(30).
