           SELECT LBD107 ASSIGN TO PATH-LBD107
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD107
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-L107 = CONTRATO-L107 ITEM-L107
                  ALTERNATE RECORD KEY IS ALT-L107 = DATA-REMESSA-L107
                            CONTRATO-L107 ITEM-L107.
