           SELECT LBD027 ASSIGN TO PATH-LBD027
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD027
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-LB27
                  ALTERNATE RECORD KEY IS DESCRICAO-LB27
                                   WITH DUPLICATES.
