           SELECT LBD026 ASSIGN TO PATH-LBD026
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD026
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-LB26
                  ALTERNATE RECORD KEY IS DESCRICAO-LB26
                                   WITH DUPLICATES.
