           SELECT LBD029 ASSIGN TO PATH-LBD029
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD029
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-LB29
                  ALTERNATE RECORD KEY IS DESCRICAO-LB29
                                   WITH DUPLICATES.
