           SELECT LBD023 ASSIGN TO PATH-LBD023
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD023
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-LB23
                  ALTERNATE RECORD KEY IS DESCRICAO-LB23
                                   WITH DUPLICATES.
