           SELECT LBD101 ASSIGN TO PATH-LBD101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD101
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-L101 = DATA-MOVTO-L101 SEQ-L101.
