           SELECT LBD030 ASSIGN TO PATH-LBD030
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-LBD030
                  RECORD KEY IS CODIGO-LB30
                  ALTERNATE RECORD KEY IS DESCRICAO-LB30
                            WITH DUPLICATES.
