      *ARQUIVO DE MONTAGEM NO ALBUM 1 VISITA
       FD  MTD023.
       01  REG-MTD023.
           05  ALBUM-MTG3.
               10  CONTRATO-MTG3    PIC 9(4).
               10  SEQ-MTG3         PIC 9(4).
           05  VENDEDOR-MTG3        PIC 9(6).
           05  DATA-MTG3            PIC 9(8).
