      *  Cadastro de Status de Contrato (que aparece no MTD052)
       FD  MTD052.
       01  REG-MTD052.
           05  CODIGO-MTD052            PIC 99.
