      *   Arquivo de inclusao de motivos
       FD  MTD025.
       01  REG-MTD025.
           05  CHAVE-MT25.
               10 CONTRATO-MT25    PIC 9(04).
               10 ALBUM-MT25       PIC 9(04).
           05  MOTIVO-MT25         PIC 9(03).
           05  DATA-MT25           PIC 9(08).
           05  FILLER              PIC X(30).

