           SELECT MTD001 ASSIGN TO PATH-MTD001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-MTD001
                  RECORD KEY IS CONTRATO-MT01.
