           SELECT MTD020CU ASSIGN       TO   PATH-MTD020CU
                           ORGANIZATION IS         INDEXED
                           ACCESS MODE  IS         DYNAMIC
                           STATUS       IS     ST-MTD020CU
                           LOCK MODE    IS       AUTOMATIC
                           WITH LOCK    ON          RECORD
                           RECORD KEY   IS CONTRATO-MTG-CU.
