           SELECT MTD022 ASSIGN TO PATH-MTD022
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-MTD022
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS ALBUM-MT22
                  ALTERNATE RECORD KEY IS ALT-MT22 = NOME-FORM-MT22
                                                     ALBUM-MT22.
