           SELECT MTD020E  ASSIGN       TO    PATH-MTD020E
                           ORGANIZATION IS         INDEXED
                           ACCESS MODE  IS         DYNAMIC
                           STATUS       IS      ST-MTD020E
                           LOCK MODE    IS       AUTOMATIC
                           WITH LOCK    ON          RECORD
                           RECORD KEY   IS  CONTRATO-MTG-E.
