           SELECT MTD023 ASSIGN TO PATH-MTD023
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-MTD023
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS ALBUM-MTG3
                  ALTERNATE RECORD KEY IS CHAVE-MTG3 =
                  DATA-MTG3, ALBUM-MTG3.
