      * Arquivo de parametrizacao de portadores x retornos bancos
       FD  PAR002.
       01  REG-PAR002.
           05 CHAVE-PAR002.
              10 PROGRAMA-PAR002               PIC X(08).
           05 PORTADOR-PAR002-R                PIC 9(04).
           05 PORTADOR-PAR002-D                PIC 9(04).
