           SELECT PAR001 ASSIGN       TO  PATH-PAR001
                         ORGANIZATION IS      INDEXED
                         ACCESS MODE  IS      DYNAMIC
                         LOCK MODE    IS    AUTOMATIC
                         WITH LOCK    ON       RECORD
                         STATUS       IS    ST-PAR001
                         RECORD KEY   IS CHAVE-PAR001.
