      * Arquivo p/ armazenar a chave do arquivo PFD010.
       FD  PFD001.
       01  REG-PFD001.
           05  DATA-PROGR-PF001   PIC 9(8).
           05  SEQ-PF001          PIC 9(3).
