       FD  PRD102.
       01  REG-PRD102.
           05  NR-PLAN-PR102.
               10 CIDADE-PR102   PIC 9(4).
               10 MESDIA-PR102   PIC 9(4).
               10 ANO-PR102      PIC 9(4).
               10 SEQ-PR102      PIC 9(2).
           05  SEQ-VEI-PR102     PIC 99.
           05  CODIGO-PR102      PIC 9(3).
           05  DATA-SAIDA-PR102  PIC 9(8).
           05  HORA-PR102        PIC X(5).
           05  LOCAL-PR102       PIC X(15).
      * {PLANEJAMENTO DE VEICULO}
