       FD  PRD103.
       01  REG-PRD103.
           05  NR-PLAN-PR103.
               10 CIDADE-PR103   PIC 9(4).
               10 MESDIA-PR103   PIC 9(4).
               10 ANO-PR103      PIC 9(4).
               10 SEQ-PR103      PIC 9(2).
           05  CODIGO-PR103      PIC 9(3).
           05  QTDE-PR103        PIC 9(5)V99.
      * {PLANEJAMENTO DE MATERIAL}
