       FD  PRD104.
       01  REG-PRD104.
           05  NR-PLAN-PR104.
               10 CIDADE-PR104   PIC 9(4).
               10 MESDIA-PR104   PIC 9(4).
               10 ANO-PR104      PIC 9(4).
               10 SEQ-PR104      PIC 9(2).
           05  SEQ-OBS-PR104     PIC 9(2).
           05  OBSERVACAO-PR104  PIC X(80).
      * {PLANEJAMENTO DE OBS     }
