           SELECT PRD102 ASSIGN TO PATH-PRD102
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-PRD102
                  LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-PR102 = NR-PLAN-PR102
                        SEQ-VEI-PR102.
