           SELECT PRD104 ASSIGN TO PATH-PRD104
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-PRD104
                  LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-PR104 = NR-PLAN-PR104
                        SEQ-OBS-PR104.
