           SELECT PRD012 ASSIGN TO PATH-PRD012
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-PRD012
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-PR12 =
                      CONTRATO-PR12
                      SEQUENCIA-PR12.
