      *CADASTRO DE ESCALA DE VENDAS X PRODUTOS
       FD  RCD109P.
       01  REG-RCD109P.
           05 CHAVE-RC109P.
              10 CONTRATO-RC109P                  PIC 9(06).
              10 ESCALA-RC109P                    PIC 9(03).
              10 PRODUTO-RC109P                   PIC 9(04).
           05 VALOR-BASE-RC109P                   PIC 9(06)v99.
           05 FILLER                              PIC X(100).

