      *PARCELAS C/ JUROS                             
       FD  RCD1101.
       01  REG-RCD1101.
           05 CHAVE-RC1101.
              10 CODIGO-RC1101                    PIC 9(06).
              10 PARCELA-RC1101                   PIC X(07).
           05 JUROS-RC1101                        PIC X(03).
           05 FILLER                              PIC X(50).

