      *  Cadastro de Status de Contrato (que aparece no RCD203)
       FD  RCD203.
       01  REG-RCD203.
           05  CODIGO-RCD203            PIC 99.
