           SELECT RCD112 ASSIGN TO PATH-RCD112
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-RCD112
                  RECORD KEY IS CHAVE-RC112.
