           SELECT RCD109P ASSIGN TO PATH-RCD109P
                          ORGANIZATION IS INDEXED
                          ACCESS MODE IS DYNAMIC
                          LOCK MODE IS AUTOMATIC
                          WITH LOCK ON RECORD
                          STATUS IS ST-RCD109P
                          RECORD KEY IS CHAVE-RC109P.
