           SELECT RCD100E  ASSIGN       TO    PATH-RCD100E
                           ORGANIZATION IS         INDEXED
                           ACCESS MODE  IS         DYNAMIC
                           STATUS       IS      ST-RCD100E
                           LOCK MODE    IS       AUTOMATIC
                           WITH LOCK    ON          RECORD
                           RECORD KEY   IS CHAVE-ALBUM-REC-E.
