           SELECT RCD001 ASSIGN TO PATH-RCD001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-RCD001
                  RECORD KEY IS CODIGO-COMIS-RC01.
