           SELECT RCD001 ASSIGN TO PATH-RCD001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-RCD001
                  RECORD KEY IS CODIGO-COMIS-RC01.
      *VALOR DA PERCENTAGEM DA COMISSÃO DO VENDEDOR
       FD  RCD001.
       01  REG-RCD001.
           05  CODIGO-COMIS-RC01   PIC 9.
           05  VALOR-COMIS-RC01    PIC 99V999.
