       FD  RED303.
       01  REG-RED303.
           05  DOCTO-R303           PIC 9(6).
           05  SEQ-R303             PIC 9(3).
           05  REPRES-R303          PIC 9(3).
           05  FUNCAO-R303          PIC 9(2).
           05  QT-FILMES-R303       PIC 999.
           05  QT-REPORT-R303       PIC 9V9.
           05  VLR-REPORT-R303      PIC 9(8)V99.
