      *CADASTRO DE EVENTOS E CONTRATOS POR DOCTO-REPORTAGEM
       FD  RED101.
       01  REG-RED101.
           05  DOCTO-R101           PIC 9(6).
           05  CONTRATO-R101        PIC 9(4).
           05  EVENTO-R101          PIC 9(5).
           05  QT-PARTIC-R101       PIC 9(4).
