      *  Cadastro de Status de Contrato (que aparece no REP101)
       FD  REP101A.
       01  REG-REP101A.
           05  CODIGO-REP101A           PIC 99.
