      *  Cadastro de Status de Contrato (que aparece no RED206)
       FD  RED206.
       01  REG-RED206.
           05  CODIGO-RED206            PIC 99.
