      *   RELACAO PESSOAL PRE-SELECIONADO P/ PLANEJAMENTO DE REPORTAGEM
       FD  RED501.
       01  REG-RED501.
           05  CIDADE-RE501          PIC 9(4).
           05  FUNCAO-RE501          PIC 9(2).
           05  CODIGO-RE501          PIC 9(6).
           05  DATA-SEG-RE501        PIC 9(8).
           05  PADRAO-RE501          PIC X.
