       FD  red090.
       01  REG-red090.
           05  CODIGO-R090               PIC 99.
           05  CODIGO-REP-R090           PIC 9(3).
           05  NOME-R090                 PIC X(20).
      * CODIGO-REP-R090 - CODIGO DA REPORTAGEM EM QUE DEVE SAIR OS
      * VALORES PARA PAGAMENTO.
