           SELECT RED100 ASSIGN TO PATH-RED100
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED100
                  LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
                  RECORD KEY IS DOCTO-R100
                  ALTERNATE RECORD KEY IS DATA-MOV-R100 WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ANOMES-R100 WITH DUPLICATES.
