           SELECT RED302 ASSIGN TO DISK
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED302
                  RECORD KEY IS CHAVE-R302 = DOCTO-R302 EVENTO-R302
                  ALTERNATE RECORD KEY IS EVENTO-R302 WITH DUPLICATES.
