           SELECT RED005 ASSIGN TO PATH-RED005
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-RED005
                  RECORD KEY IS CODIGO-RE05
                  ALTERNATE RECORD KEY IS HOTEL-RE05 WITH DUPLICATES
                  ALTERNATE RECORD KEY IS ALT-RE05 = NOME-CID-RE05
                            HOTEL-RE05 WITH DUPLICATES.
