           SELECT RED007 ASSIGN TO PATH-RED007
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED007
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-RE07
                  ALTERNATE RECORD KEY IS CATEGORIA-RE07.
