           SELECT RED301 ASSIGN TO PATH-RED301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED301
                  RECORD KEY IS CHAVE-R301 = DOCTO-R301 CONTRATO-R301
                  ALTERNATE RECORD KEY IS CONTRATO-R301 WITH DUPLICATES.
