           SELECT RED008 ASSIGN TO PATH-RED008
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED008
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-RE08 = PROPRIETARIO-RE08
                                             EQUIPAMENTO-RE08.
