           SELECT RED002 ASSIGN TO PATH-RED002
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-RED002
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-RE02
                  ALTERNATE RECORD KEY IS DESCRICAO-RE02.
