      *  ARQUIVO DE INSTRUÇÕES E OBS DE INSERT DE VÍDEO - LINHAS DE OBS
       FD  VID115.
       01  REG-VID115.
           05  CONTRATO-V115          PIC 9(4).
           05  ITEM-V115              PIC 9(2).
           05  SEQ-V115               PIC 9(2).
           05  SUBSEQ-V115            PIC 9(2).
           05  OBS-V115               PIC X(100).
