      *  ARQUIVO DE INSTRUÇÕES E OBS DE COPIA DE VÍDEO
       FD  VID112.
       01  REG-VID112.
           05  CONTRATO-V112          PIC 9(4).
           05  ITEM-V112              PIC 9(2).
           05  SEQ-V112               PIC 9(2).
           05  FUNCIONARIO-V112       PIC 9(6).
           05  REVISOR-V112           PIC 9(6).
           05  DATA-V112              PIC 9(8).
           05  HORARIO-V112           PIC 9(4).
           05  USUARIO-V112           PIC X(5).
