      * ARQUIVO DE OBS - DEPTO VENDAS/QUALIDADE GERAL
      * SE TIPO = 1-VENDAS   2-QUALIDADE GERAL
       FD  VID119.
       01  REG-VID119.
           05  CONTRATO-V119           PIC 9(4).
           05  ITEM-V119               PIC 9(2).
           05  TIPO-V119               PIC 9.
           05  SEQ-V119                PIC 9(2).
           05  OBS-V119                PIC X(100).
