           SELECT VID020 ASSIGN TO PATH-VID020
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-VID020
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-V20
                  ALTERNATE RECORD KEY IS DESCRICAO-V20 WITH DUPLICATES.
