      *   Cadastro CONTAS A RECEBER (KAC ATENDIMENTO AO CLIENTE)
       FD  ACD120.
       01  REG-ACD120.
           05 NUMERO-AC120                       PIC 9(11).
           05 CONTRATO-AC120                     PIC 9(08).
           05 DATA-AC120                         PIC 9(08).
           05 DTDEP1-AC120                       PIC 9(08).
           05 DTDEP2-AC120                       PIC 9(08).
           05 DTDEP3-AC120                       PIC 9(08).
           05 DTDEP4-AC120                       PIC 9(08).
           05 AGENCIA1-AC120                     PIC X(20).
           05 AGENCIA2-AC120                     PIC X(20).
           05 AGENCIA3-AC120                     PIC X(20).                          
           05 AGENCIA4-AC120                     PIC X(20).
           05 VLRORIG1-AC120                     PIC 9(05)V99.
           05 VLRORIG2-AC120                     PIC 9(05)V99.
           05 VLRORIG3-AC120                     PIC 9(05)V99.
           05 VLRORIG4-AC120                     PIC 9(05)V99.
           05 JUROS1-AC120                       PIC 9(03)V99.
           05 JUROS2-AC120                       PIC 9(03)V99.
           05 JUROS3-AC120                       PIC 9(03)V99.
           05 JUROS4-AC120                       PIC 9(03)V99.
           05 DESCONTO1-AC120                    PIC 9(03)V99.
           05 DESCONTO2-AC120                    PIC 9(03)V99.
           05 DESCONTO3-AC120                    PIC 9(03)V99.
           05 DESCONTO4-AC120                    PIC 9(03)V99.
           05 VLRTOTAL1-AC120                    PIC 9(05)V99.
           05 VLRTOTAL2-AC120                    PIC 9(05)V99.
           05 VLRTOTAL3-AC120                    PIC 9(05)V99.
           05 VLRTOTAL4-AC120                    PIC 9(05)V99.
           05 OBSERVACAO1-AC120                  PIC X(70).
           05 OBSERVACAO2-AC120                  PIC X(70).
           05 OBSERVACAO3-AC120                  PIC X(70).
           05 OBSERVACAO4-AC120                  PIC X(70).
           05 OBSERVACAO5-AC120                  PIC X(70).
           05 OBSERVACAO6-AC120                  PIC X(70).
           05 OBSERVACAO7-AC120                  PIC X(70).
           05 OBSERVACAO8-AC120                  PIC X(70).
           05 OBSERVACAO9-AC120                  PIC X(70).
           05 OBSERVACAO10-AC120                 PIC X(70).
           05 FILLER                             PIC X(200).


