      *   Cadastro de Ordem de Serviços (KAC ATENDIMENTO AO CLIENTE)
       FD  ACD130.
       01  REG-ACD130.
           05 PROCEDIMENTO-AC130                 PIC 9(01).
           05 DESTINO-AC130                      PIC 9(01).
           05 NUMERO-AC130                       PIC 9(11).
           05 CONTRATO1-AC130                    PIC 9(08).
           05 CONTRATO2-AC130                    PIC 9(08).
           05 CONTRATO3-AC130                    PIC 9(08).
           05 CONTRATO4-AC130                    PIC 9(08).
           05 CONTRATO5-AC130                    PIC 9(08).
           05 CONTRATO6-AC130                    PIC 9(08).
           05 CONTRATO7-AC130                    PIC 9(08).
           05 CONTRATO8-AC130                    PIC 9(08).
           05 CONTRATO9-AC130                    PIC 9(08).
           05 PRODUTO1-AC130                     PIC 9(05).
           05 PRODUTO2-AC130                     PIC 9(05).
           05 PRODUTO3-AC130                     PIC 9(05).
           05 PRODUTO4-AC130                     PIC 9(05).
           05 PRODUTO5-AC130                     PIC 9(05).
           05 PRODUTO6-AC130                     PIC 9(05).
           05 PRODUTO7-AC130                     PIC 9(05).
           05 PRODUTO8-AC130                     PIC 9(05).
           05 PRODUTO9-AC130                     PIC 9(05).
           05 QTDE1-AC130                        PIC 9(04).
           05 QTDE2-AC130                        PIC 9(04).
           05 QTDE3-AC130                        PIC 9(04).
           05 QTDE4-AC130                        PIC 9(04).
           05 QTDE5-AC130                        PIC 9(04).
           05 QTDE6-AC130                        PIC 9(04).
           05 QTDE7-AC130                        PIC 9(04).
           05 QTDE8-AC130                        PIC 9(04).
           05 QTDE9-AC130                        PIC 9(04).
           05 QTDETOT-AC130                      PIC 9(06).
           05 ID1-AC130                          PIC X(01).
           05 ID2-AC130                          PIC X(01).
           05 ID3-AC130                          PIC X(01).
           05 ID4-AC130                          PIC X(01).
           05 ID5-AC130                          PIC X(01).
           05 ID6-AC130                          PIC X(01).
           05 ID7-AC130                          PIC X(01).
           05 ID8-AC130                          PIC X(01).
           05 ID9-AC130                          PIC X(01).
           05 DATA1-AC130                        PIC 9(08).
           05 DATA2-AC130                        PIC 9(08).
           05 DATA3-AC130                        PIC 9(08).
           05 DATA4-AC130                        PIC 9(08).
           05 DATA5-AC130                        PIC 9(08).
           05 DATA6-AC130                        PIC 9(08).
           05 DATA7-AC130                        PIC 9(08).
           05 DATA8-AC130                        PIC 9(08).
           05 DATA9-AC130                        PIC 9(08).
           05 DIA1-AC130                         PIC 9(03).
           05 DIA2-AC130                         PIC 9(03).
           05 DIA3-AC130                         PIC 9(03).
           05 DIA4-AC130                         PIC 9(03).
           05 DIA5-AC130                         PIC 9(03).
           05 DIA6-AC130                         PIC 9(03).
           05 DIA7-AC130                         PIC 9(03).
           05 DIA8-AC130                         PIC 9(03).
           05 DIA9-AC130                         PIC 9(03).
           05 OBSERVACAO1-AC130                  PIC X(80).
           05 OBSERVACAO2-AC130                  PIC X(80).
           05 OBSERVACAO3-AC130                  PIC X(80).
           05 OBSERVACAO4-AC130                  PIC X(80).
           05 DATA-KAC-ATENDIMENTO-AC130         PIC 9(08).
           05 DATA-DESTINO-AC130                 PIC 9(08).
           05 DATA-KAC-RETORNO-AC130             PIC 9(08).
           05 FILLER                             PIC X(100).


