      *  Movimento de atendimento a cliente - informacao
      *  complementares da area 
       FD  ACD105.
       01  REG-ACD105.
           05  NR-ATENDIMENTO-AC105     PIC 9(08).
           05  SEQ-REG-AC105            PIC 9(01).
           05  INFORMACAO-AC105         PIC X(80).
