      *  Movimento de atendimento a cliente - PROCEDIMENTOS
      *  KAC    
       FD  ACD102.
       01  REG-ACD102.
           05  NR-ATENDIMENTO-AC102     PIC 9(08).
           05  SEQ-REG-AC102            PIC 9(01).
           05  PROCEDIMENTO-AC102       PIC 9(06).
