      *  Movimento de atendimento a cliente - DESCRICAO
      *  SUMARIA
       FD  ACD101.
       01  REG-ACD101.
           05  NR-ATENDIMENTO-AC101     PIC 9(08).
           05  SEQ-REG-AC101            PIC 9(01).
           05  DESCRICAO-SUMARIA-AC101  PIC X(80).
