           SELECT ACD103 ASSIGN TO PATH-ACD103
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-ACD103
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-AC103 = NR-ATENDIMENTO-AC103
                                SEQ-REG-AC103.
