      *   Cadastro de Bancos 
       FD  CAD030.
       01  REG-CAD030.
           05  CODIGO-CAD30        PIC 9(04).
           05  DESCRICAO-CAD30     PIC X(60).

