           SELECT CAD003 ASSIGN TO PATH-CAD003
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CAD003
                  RECORD KEY IS PROGRAMA-CA003
                  ALTERNATE RECORD KEY IS DESCRICAO-CA003.
