           SELECT CAD012 ASSIGN TO PATH-CAD012
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-CAD012
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS CODIGO-REG
                  ALTERNATE RECORD KEY IS NOME-REG.
