       01  DATA-SISTEMA.
           05 DATA6-W          PIC 9(6)  VALUE ZEROS.
           05 DATA-INV         PIC 9(8)  VALUE ZEROS.
      *    05 DATA-BRA         PIC 9(8)  VALUE ZEROS.
           05 HORA-BRA         PIC 9(8)  VALUE ZEROS.
           05 ANO-V            PIC 9(2)  VALUE ZEROS.
