      * Cadastro de Situação de cheques - controle bancário
       FD  CBD003.
       01  REG-CBD003.
           05  SITUACAO-CB03      PIC 99.
           05  NOME-SIT-CB03      PIC X(30).
