      *  Cadastro de registro de talões de cheques
       FD  CBD002.
       01  REG-CBD002.
           05  CODIGO-FORN-CB02       PIC 9(6).
           05  NR-FOLHAS-CB02         PIC 9(4).
           05  FL-INICIAL-CB02        PIC 9(6).
           05  FL-FINAL-CB02          PIC 9(6).
           05  DATA-CB02              PIC 9(8).
