           SELECT CBD101 ASSIGN TO PATH-CBD101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  STATUS IS ST-CBD101
                  RECORD KEY IS CHAVE-CB101 = CONTA-BANCO-CB101
                        DATA-EXTRATO-CB101 SEQ-CB101
                  ALTERNATE RECORD KEY IS ALT-CB101 = DATA-EXTRATO-CB101
                    CONTA-BANCO-CB101 HISTORICO-CB101 WITH DUPLICATES.
