           SELECT CGD017 ASSIGN TO PATH-CGD017
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-CG17
                  STATUS IS ST-CGD017.
