      *CADASTRO DE TURMAS/CURSO P/ CADA EVENTO
       FD  COD061.
       01  REG-COD061.
           05  NR-CONTRATO-CO61  PIC 9(04).
           05  ITEM-CO61         PIC 9(3).
           05  CURSO-CO61        PIC 9(3).
           05  TURMA-CO61        PIC XX.
