      *  Cadastro de Status de Contrato (que aparece no COP102)
       FD  COD102.
       01  REG-COD102.
           05  CODIGO-COP102            PIC 99.
