           SELECT  COD080 ASSIGN TO PATH-COD080
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   STATUS IS ST-COD080
                   LOCK MODE IS MANUAL WITH LOCK ON RECORD
                   RECORD KEY IS CHAVE-CO80 =
                           NR-CONTRATO-CO80 ITEM-CO80.
