           SELECT  COD003 ASSIGN TO PATH-COD003
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   LOCK MODE IS MANUAL WITH LOCK ON RECORD
                   STATUS IS ST-COD003
                   RECORD KEY IS CODIGO-CO03
                   ALTERNATE RECORD KEY IS NOME-CO03 WITH DUPLICATES.
