           SELECT COD040X ASSIGN TO PATH-COD040X
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-COD040X
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS SEQ-CO40X
                  ALTERNATE RECORD KEY IS ALT-CO40X = CIDADE-CO40X
                    IDENTIFICACAO-CO40X INSTITUICAO-CO40X
                    WITH DUPLICATES.
