
       01  PARAMETROS-GRDCGC.
           05 GRDCGC-CGC                     PIC 9(014) VALUE ZERO.
           05 GRDCGC-RETORNO                 PIC X(002) VALUE SPACES.

