
       01  PARAMETROS-GRDIAS.
           05 GRDIAS-AAMMDD-INICIAL          PIC  9(008) VALUE ZEROS.
           05 GRDIAS-AAMMDD-FINAL            PIC  9(008) VALUE ZEROS.
           05 GRDIAS-NUM-DIAS                PIC  9(005) VALUE ZEROS.

