          SELECT CRD024 ASSIGN TO PATH-CRD024
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-CRD024
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-CR24 = COD-COMPL-CR24 SEQ-CR24.
