           SELECT CRD001 ASSIGN TO PATH-CRD001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-CRD001
                  RECORD KEY IS CODIGO-CR01
                  ALTERNATE RECORD KEY IS SITUACAO-TIT-CR01.
