           SELECT CXD030 ASSIGN TO PATH-CXD030
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  STATUS IS ST-CXD030
                  RECORD KEY IS COD-HISTORICO-CX30
                  ALTERNATE KEY IS HISTORICO-CX30.
