      *    CADASTRO DE TURNOS - LABORATORIO
       FD  LBD023.
       01  REG-LBD023.
           05  CODIGO-LB23              PIC 9.
           05  DESCRICAO-LB23           PIC X(15).
