      * CADASTRO DE TIPO DE FILMES
       FD  LBD021.
       01  REG-LBD021.
           05  CODIGO-LB21                PIC 9(02).
           05  DESCRICAO-LB21             PIC X(20).
           05  QT-FOTOS-LB21              PIC 99.
