           SELECT LBD100 ASSIGN TO PATH-LBD100
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD100
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  RECORD KEY IS CHAVE-L100 = DATA-MOVTO-L100 SEQ-L100
                  ALTERNATE RECORD KEY IS ALT1-L100 = CONTRATO-L100
                     FOTOGRAFO-L100 WITH DUPLICATES.
