           SELECT LBD024 ASSIGN TO PATH-LBD024
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  STATUS IS ST-LBD024
                  RECORD KEY IS CODIGO-LB24
                  LOCK MODE IS MANUAL WITH LOCK ON RECORD
                  ALTERNATE RECORD KEY IS DESCRICAO-LB24
                                   WITH DUPLICATES.
