           SELECT CGD014 ASSIGN TO PATH-CGD014
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  LOCK MODE IS AUTOMATIC
                  WITH LOCK ON RECORD
                  RECORD KEY IS COD-COMPL-CG14
                  STATUS IS ST-CGD014.
