      *  Cadastro de Status de Contrato
       FD  COD001.
       01  REG-COD001.
           05  CODIGO-CO01              PIC 99.
           05  STATUS-CO01              PIC X(30).
